{
    "version": "https://jsonfeed.org/version/1",
    "title": "2damdi",
    "description": "",
    "home_page_url": "https://narcisx.github.io/2damdi",
    "feed_url": "https://narcisx.github.io/2damdi/feed.json",
    "user_comment": "",
    "author": {
        "name": "Germán Narciso Córdoba"
    },
    "items": [
        {
            "id": "https://narcisx.github.io/2damdi/pryecto-1.html",
            "url": "https://narcisx.github.io/2damdi/pryecto-1.html",
            "title": "Pomodoro",
            "summary": "Pomodoro - Documentación Aquí encontraremos el paso a paso de cada prompt&hellip;",
            "content_html": "<section class=\"project\">\n<div class=\"project-content\">\n<h2>Pomodoro - Documentación</h2>\n<p class=\"project-description\">Aquí encontraremos el paso a paso de cada prompt indicado.</p>\n<h2 data-start=\"139\" data-end=\"174\">🧩 <strong data-start=\"145\" data-end=\"174\">Resumen de peticiones ChatGPT</strong></h2>\n<p data-start=\"176\" data-end=\"193\">1️⃣<strong> Creación de la app:</strong><br>“Hazme una app en HTML, CSS y JavaScript sin usar frameworks en el que sea una app de descanso Pomodoro.”</p>\n<p data-start=\"176\" data-end=\"193\"><br>2️⃣<strong> Funciónes:</strong><br>“Traducción a otro idioma, ejercicios que puedes hacer en los descansos, etc.”</p>\n<p data-start=\"176\" data-end=\"193\"><br>3️⃣ <strong>Cambio en el reseteo del tiempo:</strong>“function resetTimer(){ running=false; clearInterval(timer); timer=null; addHistoryEntry(mode, 'reiniciado'); startBtn.style.display='inline-block'; pauseBtn.style.display='none'; }<br><br></p>\n<p>A partir de aqui cambié a Gemini</p>\n<h2 data-start=\"139\" data-end=\"174\">🧩 <strong data-start=\"145\" data-end=\"174\">Resumen de peticiones Gemini</strong></h2>\n<p>1️⃣ <strong>\"Con este HTML, quiero que lo mejores con tus propias ideas\"</strong> Implementó mejoras profesionales en la app Pomodoro, añadiendo un selector de temas, seguimiento de tareas, un título de página dinámico y notificaciones \"toast\", además de refactorizar todo el JavaScript.</p>\n<p>2️⃣ <strong>\"Añade diferentes sonidos de alarma y un sistema de monedas\"</strong> Creó un sistema de gamificación para la app. Añadió una función para ganar monedas con cada Pomodoro completado, una animación de recompensa y una tienda para desbloquear nuevos sonidos de alarma.</p>\n<p>3️⃣ <strong>\"No he sabido implementarlo, ¿qué he puesto mal?\"</strong> Revisó el código que no funcionaba y lo depuró. Corrigió la estructura del JavaScript, solucionó errores en el CSS y restauró elementos faltantes en el HTML.</p>\n<p>4️⃣ <strong>\"El footer se ve muy alto y grande, cámbialo\"</strong> Proporcionó la línea de CSS exacta para reducir el tamaño de la fuente y el margen del <code>footer</code>, haciéndolo más pequeño y discreto.</p>\n<p>5️⃣ <strong>\"Mira cómo hay una sombra\"</strong> Identificó un fondo degradado no deseado en la sección de recompensas y especificó qué bloque de CSS se debía eliminar para solucionarlo.</p>\n<p>6️⃣ <strong>\"La app crece por culpa del historial y aparece una sombra abajo\"</strong> Modificó el CSS del historial para añadirle una altura máxima (<code>max-height</code>) y una barra de <code>scroll</code> (<code>overflow-y: auto</code>), evitando que la aplicación se hiciera más grande.</p>\n<p>7️⃣ <strong>\"Sigue apareciendo un cambio de color abajo\"</strong> Detectó que aún quedaba un borde visible. Solucionó el problema ajustando el CSS del contenedor principal para que la app ocupara toda la altura de la pantalla y eliminó la sombra (<code>box-shadow</code>) de la tarjeta.</p>\n<p>8️⃣ <strong>\"Sigue apareciendo\"</strong> Proporcionó una solución definitiva aplicando un \"reset\" de CSS para <code>html</code> y <code>body</code>, eliminando los márgenes que el navegador añade por defecto y que causaban el problema.</p>\n<p>9️⃣ <strong>\"Ahora quiero que la tienda sea un botón desplegable y poder comprar más temas. Y dame muchas monedas para probar\"</strong> Transformó la tienda en un modal que se abre con un botón. Añadió nuevos temas desbloqueables (Bosque y Océano) y ajustó el código para que el saldo inicial fuera de 500 monedas.</p>\n<p>1️⃣0️⃣ <strong>\"Añade funciones que usen la API de Gemini\"</strong> Integró la API de Gemini en la aplicación, añadiendo un botón \"✨\" para desglosar tareas complejas en subtareas y un generador de citas motivacionales dinámicas.</p>\n<p>1️⃣1️⃣ <strong>\"Hazme un compañero virtual amigable\"</strong> Creó un personaje virtual que se adapta a los colores de cada tema. Hizo que las frases de Gemini aparecieran en un bocadillo de diálogo, como si las dijera él, y lo configuró para generar una frase nueva al hacerle clic.</p>\n<p>1️⃣2️⃣ <strong>\"Quiero que lo coloques debajo de historial\"</strong> Reubicó al compañero virtual desde el panel izquierdo al panel derecho, situándolo en una nueva sección justo debajo del \"Historial\".</p>\n<p>1️⃣3️⃣ <strong>\"Mueve el botón de la tienda, pero no me estropees el programa\"</strong> Ajustó la posición del botón de la tienda, moviéndolo a la esquina superior derecha del panel lateral para que no se superpusiera a ningún contenido y tuviera una ubicación fija.</p>\n<p> </p>\n<p> </p>\n</div>\n<a href=\"https://narcisx.github.io/2damdiApps/Pomodoro/index.html\">Click aquí para ver la aplicación</a></section>",
            "image": "https://narcisx.github.io/2damdi/media/posts/3/cacaca.png",
            "author": {
                "name": "Germán Narciso Córdoba"
            },
            "tags": [
            ],
            "date_published": "2025-10-14T20:44:08+02:00",
            "date_modified": "2025-10-15T17:43:40+02:00"
        },
        {
            "id": "https://narcisx.github.io/2damdi/purebaaaasdda.html",
            "url": "https://narcisx.github.io/2damdi/purebaaaasdda.html",
            "title": "PUREBAAAASDda",
            "summary": "PUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDda",
            "content_html": "<p>PUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDdaPUREBAAAASDda</p>",
            "author": {
                "name": "Germán Narciso Córdoba"
            },
            "tags": [
            ],
            "date_published": "2025-10-14T20:42:57+02:00",
            "date_modified": "2025-10-14T20:42:57+02:00"
        }
    ]
}
